gdgly/stm32L151_nbiot_tmote_app_workspace/stm32L151_nbiot_tmote_app_spot/Hardware/NET/net_nbiot_app.c
	/* CTWING SHORT STATUS DATA ENQUEUE */
	if (NETCTWingNeedSendCode.ShortStatus) {
#if NBCTWING_SENDCODE_SHORT_STATUS
		Inspect_Message_SpotStatusDequeue(&SpotStatusData);
		NET_NBIOT_CTWingShortStructureInit();
		CTWingShortStructure.MsgPacket.Type				= CTWING_MSGTYPE_TYPE_SHORT_STATUS;
		CTWingShortStructure.DateTime						= SpotStatusData.unixTime;
		CTWingShortStructure.SpotStatus					= SpotStatusData.spot_status;
		CTWingShortStructure.SpotCount					= SpotStatusData.spot_count;
		NET_CTWing_Message_SendDataEnqueue((unsigned char *)&CTWingShortStructure, sizeof(CTWingShortStructure));
		NETCTWingNeedSendCode.ShortStatus = 0;
		Inspect_Message_SpotStatusOffSet();
		NET_NBIOT_CTWingSentDataAfterExexution();
#endif
	}
	/* CTWING LONG STATUS DATA ENQUEUE */
	else if (NETCTWingNeedSendCode.LongStatus) {
#if NBCTWING_SENDCODE_LONG_STATUS
		Inspect_Message_SpotStatusDequeue(&SpotStatusData);
		NET_NBIOT_CTWingLongStructureInit();
		CTWingLongStructure.MsgPacket.Type					= CTWING_MSGTYPE_TYPE_LONG_STATUS;
		CTWingLongStructure.DateTime						= SpotStatusData.unixTime;
		CTWingLongStructure.SpotStatus					= SpotStatusData.spot_status;
		CTWingLongStructure.SpotCount						= SpotStatusData.spot_count;
		CTWingLongStructure.MagneticX						= SpotStatusData.qmc5883lData.X_Now;
		CTWingLongStructure.MagneticY						= SpotStatusData.qmc5883lData.Y_Now;
		CTWingLongStructure.MagneticZ						= SpotStatusData.qmc5883lData.Z_Now;
		CTWingLongStructure.MagneticDiff					= SpotStatusData.qmc5883lDiff.BackVal_Diff > 65535 ? 65535 : SpotStatusData.qmc5883lDiff.BackVal_Diff;
		CTWingLongStructure.RadarDistance					= SpotStatusData.radarData.DisVal;
		CTWingLongStructure.RadarStrength					= SpotStatusData.radarData.MagVal;
		CTWingLongStructure.RadarCoverCount				= SpotStatusData.radarData.Diff_v2;
		CTWingLongStructure.RadarDiff						= SpotStatusData.radarData.Diff;
#if CTWING_STATUS_MSG_VERSION_TYPE == CTWING_STATUS_MSG_VERSION_77BYTE_V2
		CTWingLongStructure.NBRssi						= TCFG_Utility_Get_Nbiot_Rssi_IntVal();
		CTWingLongStructure.NBSnr						= TCFG_Utility_Get_Nbiot_RadioSNR();
		CTWingLongStructure.MCUTemp						= TCFG_Utility_Get_Device_Temperature();
		CTWingLongStructure.QMCTemp						= Qmc5883lData.temp_now;
		CTWingLongStructure.MagneticBackX					= Qmc5883lData.X_Back;
		CTWingLongStructure.MagneticBackY					= Qmc5883lData.Y_Back;
		CTWingLongStructure.MagneticBackZ					= Qmc5883lData.Z_Back;
		CTWingLongStructure.Debugval						= SpotStatusData.radarData.timedomain_dif;
		for (int i = 0; i < 16; i++) {
			CTWingLongStructure.Radarval[i] = radar_targetinfo.pMagNow[i+2]>255?255:radar_targetinfo.pMagNow[i+2];
			CTWingLongStructure.Radarback[i] = radar_targetinfo.pMagBG[i+2]>255?255:radar_targetinfo.pMagBG[i+2];
		}
#endif
		NET_CTWing_Message_SendDataEnqueue((unsigned char *)&CTWingLongStructure, sizeof(CTWingLongStructure));
		NETCTWingNeedSendCode.LongStatus = 0;
		Inspect_Message_SpotStatusOffSet();
		NET_NBIOT_CTWingSentDataAfterExexution();
#endif
	}
	/* CTWING WORK INFO DATA ENQUEUE */
	else if (NETCTWingNeedSendCode.WorkInfo) {
#if NBCTWING_SENDCODE_WORK_INFO
		if (TCFG_Utility_Get_Nbiot_Registered() != true) {
			return;
		}
		NET_NBIOT_CTWingInfoStructureInit();
		CTWingInfoStructure.HeadPacket.PacketType			= 0x05;
		CTWingInfoStructure.MsgPacket.Type					= CTWING_MSGTYPE_TYPE_WORK_INFO;
		len = NET_CTWING_Message_Operate_Creat_Json_Work_Info((char *)&CTWingInfoStructure.InfoData);
		NET_CTWing_Message_SendDataEnqueue((unsigned char *)&CTWingInfoStructure, sizeof(CTWingInfoStructure) - sizeof(CTWingInfoStructure.InfoData) + len);
		NETCTWingNeedSendCode.WorkInfo = 0;
		NET_NBIOT_CTWingSentDataAfterExexution();
#endif
	}
	/* CTWING BASIC INFO DATA ENQUEUE */
	else if (NETCTWingNeedSendCode.BasicInfo) {
#if NBCTWING_SENDCODE_BASIC_INFO
		if (TCFG_Utility_Get_Nbiot_Registered() != true) {
			return;
		}
		NET_NBIOT_CTWingInfoStructureInit();
		CTWingInfoStructure.HeadPacket.PacketType			= 0x05;
		CTWingInfoStructure.MsgPacket.Type					= CTWING_MSGTYPE_TYPE_BASIC_INFO;
		len = NET_CTWING_Message_Operate_Creat_Json_Basic_Info((char *)&CTWingInfoStructure.InfoData);
		NET_CTWing_Message_SendDataEnqueue((unsigned char *)&CTWingInfoStructure, sizeof(CTWingInfoStructure) - sizeof(CTWingInfoStructure.InfoData) + len);
		NETCTWingNeedSendCode.BasicInfo = 0;
		NET_NBIOT_CTWingSentDataAfterExexution();
#endif
	}
	/* CTWING DYNAMIC INFO DATA ENQUEUE */
	else if (NETCTWingNeedSendCode.DynamicInfo) {
#if NBCTWING_SENDCODE_DYNAMIC_INFO
		if (TCFG_Utility_Get_Nbiot_Registered() != true) {
			return;
		}
		NET_NBIOT_CTWingInfoStructureInit();
		CTWingInfoStructure.HeadPacket.PacketType			= 0x05;
		CTWingInfoStructure.MsgPacket.Type					= CTWING_MSGTYPE_TYPE_DYNAMIC_INFO;
		len = NET_CTWING_Message_Operate_Creat_Json_Dynamic_Info((char *)&CTWingInfoStructure.InfoData);
		NET_CTWing_Message_SendDataEnqueue((unsigned char *)&CTWingInfoStructure, sizeof(CTWingInfoStructure) - sizeof(CTWingInfoStructure.InfoData) + len);
		NETCTWingNeedSendCode.DynamicInfo = 0;
		NET_NBIOT_CTWingSentDataAfterExexution();
#endif
	}
	/* CTWING RESPONSE INFO DATA ENQUEUE */
	else if (NETCTWingNeedSendCode.ResponseInfo) {
#if NBCTWING_SENDCODE_RESPONSE_INFO
		NET_NBIOT_CTWingInfoStructureInit();
		CTWingInfoStructure.HeadPacket.PacketType			= 0x05;
		CTWingInfoStructure.MsgPacket.Type					= CTWING_MSGTYPE_TYPE_INFO;
		len = NET_CTWING_Message_Operate_Creat_Json_Response_Info((char *)&CTWingInfoStructure.InfoData, NETCTWingNeedSendCode.ResponseInfoErrcode, NETCTWingNeedSendCode.ResponseInfoMsgId);
		NET_CTWing_Message_SendDataEnqueue((unsigned char *)&CTWingInfoStructure, sizeof(CTWingInfoStructure) - sizeof(CTWingInfoStructure.InfoData) + len);
		NETCTWingNeedSendCode.ResponseInfo = 0;
		NET_NBIOT_CTWingSentDataAfterExexution();
#endif
	}
#endif
	
#if CTWING_AEPMODULE_MODE
	SpotStatusTypedef SpotStatusData;
	
	/* 检查是否有数据需要发送 */
	if (Inspect_Message_SpotStatusisEmpty() == false) {
	#if NBCTWING_SENDCODE_LONG_STATUS
		NETCTWingNeedSendCode.LongStatus = 1;
	#endif
	}
	
